#include <iostream>
//#include "DesktopApp"
#include "CorrChecker.h"
//#include "parse.h"
//#include "Drawer.h"

using namespace std;

//int main() {
//	/*-----------------------------------------*/
//	//Десктоп-приложение
//	/*-----------------------------------------*/
//
//	/////////////////////////////////////////////
//	//Пользователь вставляет код/загружает файл с кодом
//	//Артем,Андрей, для проверки на корректность требуется передать в него путь к файлу с кодом. сейчас пока путь вводится из консоли
//	/////////////////////////////////////////////
//
//	/*-----------------------------------------*/
//	//Проверка на корректность
//	CorrChecker fileToCheck;
//	if (!fileToCheck.check())// вот сюда надо будет передавать путь к файлу с кодом
//		//
//	/*-----------------------------------------*/
//
//	/////////////////////////////////////////////
//	//True/false
//	/////////////////////////////////////////////
//
//	/*-----------------------------------------*/
//	//Парсер
//	/*-----------------------------------------*/
//
//
//	/////////////////////////////////////////////
//	//Вектор структур
//	/////////////////////////////////////////////
//
//	/*-----------------------------------------*/
//	//Отрисовщик
//	/*-----------------------------------------*/
//
//	/////////////////////////////////////////////
//	//Готовая блок-схема
//	/////////////////////////////////////////////
//
//	/*-----------------------------------------*/
//	//Десктоп-приложение
//	/*-----------------------------------------*/
//
//	return 0;
//}